{
  "cs_calico_fails": [
    "How to retrieve Calico network policies",
    "View Calico network policies in your kubernetes cluster",
    "What are Calico policies",
    "overview of calico policies",
    "How to fix Calico policies",
    "How to ensure that all Calico factors align"
  ],
  "cs_dashboard_graphs": [
    "utilization graphs don't display in Kubernetes dashboard",
    "pods don't update after kubernetes cluster update or worker node reboot",
    "How to fix utilization graphs issues in kubernetes cluster",
    "How to delete the kube-dashboard pod to force a restart",
    "how to delete the kube-dashboard pod",
    "Command to delete the kube-dashboard pod to force a restart",
    "fix utilization graphs issues in kubernetes cluster"
  ],
  "long_lines": [
    "Why is the kubernetes Log lines too long",
    "How to fix kubernetes long length log",
    "In Kibana only able to see the last 600 - 700 characters of the log message",
    "Long Logs not parsed correctly by Fluentd in kubernetes",
    "limit stack_trace in kubernetes cluster",
    "kubernetes logs are too long "
  ],
  "debug_apps": [
    "debug the app deployments in kubes",
    "find the root causes for failures while debugging a kubernetes app",
    "While debugging a kubernetes app how to verify the service is listening on the correct port.",
    "verify that the service is linked correctly to the pods in kubernetes",
    "How to verify that the service is linked for Ingress ",
    "check the service is linked correctly to the pods in kubernetes"
  ],
  "ts-app-02-imgpull": [
    "Issues with with ImagePullBackOff or authorization errors",
    "Failed to pull image from registry with ImagePullBackOff",
    "Pods fail with an ImagePullBackOff status",
    "ImagePullBackOff in kubernetes",
    "what to do if no image pull secrets are listed in kubernetes",
    "ImagePullBackOff - what credentials to use to access IBM Cloud Container Registry",
    "ImagePullBackOff error in kubenetes"
  ],
  "containers_do_not_start": [
    "After pods deployment containers don't start",
    "Why don't the containers start after cluster successful deployment",
    "Containers might not start when the registry quota",
    "How to free up storage in Cloud Container Registry",
    "Containers don't start",
    "unable to start containers for kubernetes"
  ],
  "cs_psp": [
    "Pods fail to deploy because of a pod security policy in kubernetes",
    "Error message unable to validate against any pod security policy in kubernetes",
    "How to fix Pods fail to deploy because of a pod security policy in kubernetes",
    "Why do the pods fail to deploy",
    "error trying to deploy pods in kubernetes",
    "PodSecurityPolicy admission controller",
    "unable to validate against any pod security policy in kubernetes"
  ],
  "cs_pods_pending": [
    "Pods remain in pending state in kubernetes",
    "when you run kubectl get pods, you can see pods that remain in a Pending state",
    "Issue with existing cluster for the pods to be in pending state",
    "How to fix pods in pending state in kubernetes",
    "Don't have enough capacity in your cluster",
    "Pods are still pending in kubernetes"
  ],
  "pods_fail": [
    "kubernetes Pods repeatedly fail to restart or are unexpectedly removed",
    "Kubernetes Pod was healthy but unexpectedly gets removed or gets stuck in a restart loop",
    "Whats happening to my pods repeatedly failing in kubernetes",
    "How fix a repeatedly failing kubernetes cluster pod",
    "How to check priorityClassName field for kubernetes",
    "pod gets stuck in a restart loop in kubes",
    "pods repeatedly failing in kubernetes"
  ],
  "cs_duplicate_services": [
    "Error when Binding a service to a cluster results in same name",
    "Error Multiple services with the same name were found in kubes",
    "Error Run 'ibmcloud service list' to view available Bluemix service instances in kubernetes",
    "How to fix issues with binding a service to a cluster",
    "kubernetes service instances might have the same name in different regions.",
    "Error Run 'ibmcloud service list' given in kubernetes"
  ],
  "cs_not_found_services": [
    "Why does Binding a service to a cluster results in service not found error in kubes",
    "Error binding service to a namespace",
    "Kubernetes error The specified IBM Cloud service could not be found",
    "How to fix Binding a kubernetes service resulting in service not found error",
    "kubernetes issue with IBM Cloud IAM permissions",
    "Binding a kubernetes service resulting in service not found error"
  ],
  "cs_service_keys": [
    "binding a service to a cluster results in service does not support service keys error",
    "Error in Kubernetes- This service doesn't support creation of keys",
    "What are service keys for kubes",
    "How to find a list of services that support the creation of service keys in kubernetes",
    "Details on Key Protect with Kubernetes",
    "error service does not support service keys error in kubernetes",
    "service does not support service keys error in Kubernetes"
  ],
  "cs_helm_install": [
    "Issues with installing a Helm chart",
    "Error: failed to download <helm_repo>/<chart_name>",
    "Reason to update your Helm installation",
    "Error: failed to download Helm chart",
    "How fix Helm install chart issues",
    "How to list the IBM Cloud Helm repositories currently available ",
    "can't install a Helm chart"
  ],
  "debug_addons": [
    "check the health state and status of a kubernetes cluster add-on",
    "Add-on health state and its descriptions in kubernetes",
    "Kubernetes sdd-on health state critical normal pending updating warning ",
    "Kubernetes cluster resources low, not enough workers in Ready state.",
    "Istio data plane components may need to be updated",
    "view the status of a kubernetes cluster add-on",
    "check the health of a cluster add-on"
  ],
  "control_plane": [
    "Why are the Istio components missing",
    "istio-citadel or istio-telemetry does not exist in your cluster.",
    "Issues with deleting one of the Istio deployments",
    "How to  reconciles the installation of Istio to the original add-on settings?",
    "How to fix missing components in Istio?",
    "Istio components missing for kubernetes"
  ],
  "cs_loadbalancer_fails": [
    "Issues with connecting to an app via a network load balancer service",
    "issue connecting kubes with NLB",
    "Connection failed or timed out when trying to connect to public IP address of the NLB in kubernetes",
    "Problem with your configuration script for your NLB service includes error",
    "How to fix NLB service problems",
    "Error - Requested cloud provider IP is not available. The following cloud provider IPs are available:",
    "trying to connect to public IP address of the NLB in kubernetes"
  ],
  "cs_subnet_limit_lb": [
    "can't deploy a load balancer to kubernetes clusters",
    "Error Warning  CreatingLoadBalancerFailed ... ErrorSubnetLimitReached:",
    "Error There are already the maximum number of subnets permitted in this VLAN in kubernetes",
    "How to verify that the subnet was successfully created and added to your kubernetes cluster?",
    "How to list the Subnet VLANs in kubernetes",
    "what Subnet VLANs are deployed in kubernetes",
    "issue deploying a load balancer to kubernetes clusters"
  ],
  "vpc_ts_lb": [
    "Problem connecting to a VPC app via kubernetes load balancer",
    "Connection fails or times out - can't connect to an app via load balancer in kubernetes",
    "Error The VPC load balancer that routes requests to this Kubernetes LoadBalancer service is offline.",
    "Error The VPC load balancer that routes requests to this Kubernetes LoadBalancer service was deleted from your VPC.",
    "How to remove the load balancing setup for an app in your VPC cluster",
    "error connecting kubernetes load balancer to VPC"
  ],
  "vpc_no_lb": [
    "Issue with Kubernetes LoadBalancer service fails because no IPs are available",
    "Warning message - The subnet with ID(s) '<subnet_id>' has insufficient available ipv4 addresses",
    "Problem with VPC you can't resize it or change its IP range",
    "How to create a new worker pool in your kubernetes cluster",
    "How to verify if your LoadBalancer service is successfully provisioned in kubernetes",
    "Kubernetes LoadBalancer service failing with no IPs are available"
  ],
  "ingress_subdomain": [
    "why does this happen - No Ingress subdomain exists after cluster creation",
    "The cluster State is normal, but the Ingress Subdomain and Ingress Secret are not available",
    "Ingress subdomain and secret creation takes more time for creation ",
    "How to update config maps for kubernetes",
    "How to check the progress of the Ingress creation in kubernetes",
    "Ingress Subdomain and Ingress Secret are not available for kubernetes cluster"
  ],
  "cs_ingress_fails": [
    "Problem with connecting to an app via Ingress (Classic clusters)",
    "Trying to connect to your app by using the public IP address or Ingress subdomain, the connection failed or timed out.",
    "check if kubernetes cluster is fully deployed",
    "What to do if no Ingress Subdomain is available",
    "no Ingress Subdomain is available",
    "connecting to an app via Ingress",
    "no Ingress Subdomain is available for kubernetes"
  ],
  "vpc_ts_alb": [
    "Problem with connecting to an app via Ingress with VPC clusters",
    "connect the app by using the subdomain of the Ingress application load balancer failed",
    "connection timed out connecting to an app via Ingress",
    "Reasons why requests can't be routed to your app ",
    "How to verify that no VPC security groups are blocking traffic to your cluster ",
    "How to see the hostnames for your public and private ALBs",
    "see the hostnames for your public and private ALBs in kubes"
  ],
  "one_alb": [
    "Issues with accessing your app through a specific ALB IP",
    "How to get the name of the ALB with the unreachable IP address.",
    "Check fails when attempting to cURL the alb health host to health",
    "Steps take in removing an ALB from DNS",
    "verify ALB IP address has been restored in the DNS registration ",
    "issue with application load balancer IP address"
  ],
  "cs_albsecret_fails": [
    "Description field is not updating with the secret name after Ingress deploy",
    "Description field does not contain secret name",
    "ALB secret failing",
    "creating ALB secret fails",
    "list information about the ALB secret fails"
  ],
  "cs_subnet_limit": [
    "Issues in multizone cluster where in one zone no ALB is deployed",
    "what is the reason public Ingress ALB for that zone fails to provision",
    "How to view how many subnets in a VLAN in kubernetes",
    "public Ingress ALB for a zone fails to provision",
    "how many subnets for ALB",
    "How to setup VLAN spanning in kubernetes",
    "How to add subnet to a ibmcloud ks cluster in kubernetes",
    "adding subnet to a ibmcloud ks cluster in kubernetes"
  ],
  "cs_alb_subnet": [
    "Problem with Ingress ALB can't be enabled due to subnet errors",
    "Error No valid subnets found for the specified zone. Verify that a subnet exists on the VLAN in the zone that you specify by running 'ibmcloud ks subnets'",
    "How to verify one or more subnets are available on the VLAN in the zone where the ALB exists.",
    "Steps to Moving ALBs across VLANs.",
    "No valid subnets found for the specified zone for ALB",
    "Why does my ALBs and worker nodes might not exist on the same VLANs",
    "No valid subnets found for the specified zone error for ALB"
  ],
  "cs_source_ip_fails": [
    "no traffic reaches the back-end service for your app with kubes",
    "What are Edge node taints and Custom taints in kubernetes",
    "Source IP preservation fails when using tainted nodes in kubes",
    "How to use kubernetes taints",
    "How to resolve Source IP preservation fails in kubernetes",
    "How to get keepalived pods within kubes"
  ],
  "cs_ingress_websocket": [
    "Connection via WebSocket closes after 60 seconds in kubernetes",
    "app closes when no traffic is sent between them for 60 seconds in ingress",
    "prevent the connection from closing after 60 seconds of inactivity in ingress",
    "increase value of the timeout or set up a heartbeat in the app in kubernetes cluster",
    "increase the timeout in kubernetes cluster",
    "How to setup ping/pong traffic for kubernetes",
    "setting up kubernetes ping pong traffic",
    "connection via WebSocket closes after 1 minute in kubernetes"
  ],
  "debug_utility": [
    "How to install the diagnostic tool for kubernetes cluster",
    "What is kubernetes cluster add-ons",
    "installing the kubernetes debug tool",
    "How can I install the Debug Tool",
    "install the debug tool for kubernetes",
    "installing Debug Tool in kubernetes",
    "How to check the status of kubernetes cluster",
    "what is my kubernetes cluster state",
    "How to enable kubernetes debug tool",
    "install the debugging tool for kubes",
    "installing diagnostics for kubernetes cluster"
  ],
  "debug_clusters": [
    "Why my kubernetes cluster still deploying?",
    "Why my kubernetes cluster state show aborted?",
    "What is the state of my kubernetes cluster",
    "How can I debug Kubernetes",
    "kubernetes debugging",
    "How can I debug Kubernetes cluster",
    "deleted a kubernetes cluster, but it keeps deleting for over 10 hours",
    "debugging kubernetes",
    "My kubernetes cluster state is critical",
    "cluster state is critical",
    "Can't delete my kubernetes cluster",
    "find state of my kubernetes cluster"
  ],
  "debug_master": [
    "Can I mange my kubernetes master server security",
    "see error message from my kubernetes master",
    "How to get my cluster master information",
    "What is kubernetes master",
    "Why kubernetes master reporting error",
    "review my kubernetes master server security"
  ],
  "cs_ssh_worker": [
    "How to ssh to my kubernetes workers",
    "How to access kubernetes worker",
    "What is the password to my kubernetes workers",
    "Can I enable ssh to worker in kubernetes cluster?",
    "Do I have access to kubernetes worker",
    "enable ssh to worker in kubernetes"
  ],
    "cluster_infra_errors": [
    "trouble deleting worker node on kubernetes cluster",
    "I have clusters that can't be deleted",
    "cluster deleting",
    "my kubernetes cluster cannot be deleted",
    "cannot delete kubernetes cluster",
    "unable to delete cluster",
    "error trying to delete my worker node",
    "fail to delete a worker node in kubernetes cluster",
    "cannot proceed to create the cluster",
    "unable to create a cluster",
    "I cannot create a Kubernetes standard cluster"
  ],
  "cs_credentials": [
    "unable to create a kubernetes cluster",
    "can't create a cluster",
    "i cant create my own cluster",
    "How to manage kubernetes nodes",
    "can not create a kubernetes cluster",
    "not able to create a kubernetes cluster due to permission errors",
    "Unable to connect to your kubernetes infrastructure account",
    "kubernetes cluster could not be configured with the registry?",
    "cant create a kubernetes cluster due to permission errors"
  ],
  "faq_free": [
    "Can I have a free kubernetes cluster",
    "create free Kubernetes cluster in account",
    "want to provision free Kubernetes cluster",
    "how to add a free cluster",
    "can I create a free cluster",
    "provision a free cluster",
    "provisioning a free cluster",
    "not able to create  free k8s cluster",
    "Why am I unable to create a free cluster",
    "I can not create Kubernetes cluster even the free version",
    "not able to create free cluster for kubernetes",
    "unable to create free kubernetes cluster",
    "how can i create cluster for free",
    "can i get free cluster",
    "trying to create a free Kubernetes Cluster",
    "not able to create my free cluster",
    "free kubernetes cluster",
    "provision a free Kubernetes cluster",
    "unable to use free Kubernetes service",
    "want to learn free kubernetes",
    "Trying to create a kubernetes service with the free pricing plan",
    "How to transfer from free kubernetes cluster to paid cluster?",
    "need a kubernetes cluster for free"
  ],
  "charges": [
    "how much is Kubernetes",
    "how much does kubernetes cost",
    "estimate the costs for kubernetes",
    "how much does a cluster cost",
    "how much for a kubernetes cluster",
    "cost for a cluster for kubernetes",
    "cost estimator for kubernetes",
    "check the cost per worker nodes",
    "how much is a worker node",
    "what is the pricing structure of kubernetes",
    "pricing for kubernetes",
    "how do you charge for kubernetes",
    "how do you charge kubernetes cluster",
    "kubernetes cost estimate",
    "cost calulator for kubernetes"
 ],
  "container_platforms": [
    "What container platforms are available for kubernetes cluster",
    "the difference between kubernetes and openshift",
    "Comparing openshift and kubernetes",
    "What operating system does openshift run",
    "What operating system does kubernetes run",
    "operating system kuberentes runs on",
    "kubernetes and redhat openshift differences"
  ],
  "managed_master_worker": [
    "Does the service come with a managed Kubernetes master and worker",
    "How to update kubernetes cluster add-ons",
    "How to update kubernetes cluster master",
    "How to update kubernetes cluster workers",
    "What is Deprecated Kubernetes versions",
    "want to update kubernetes cluster"
  ],
  "ha_sla": [
    "Is kubernetes service highly available",
    "What is multizone kubernetes cluster",
    "Does kubernetes offer HA?",
    "Kuberentes highly available",
    "What is the HA components of kubernetes",
    "How to set up multizone kubernetes cluster",
    "is kubernetes highly available"
  ],
  "debug_worker_nodes": [
    "Why my kubernetes worker is in critical condition",
    "kubernetes worker stuck in pending state",
    "What maintenance needed to run on kubernetes worker",
    "How to check the status of the kubernetes worker node",
    "Reloading the worker is failing",
    "kubernetes worker stuck in pending"
  ],
  "faq_tags": [
    "Can I add tags to my kubernetes cluster?",
    "How to add tags to existing kubernetesclusters?",
    "Why add tags to kubernetes cluster?",
    "add tags to a cluster",
    "What the difference between kubernetes tags and labels?",
    "How to find tags for kubernetes or openshift?",
    "add a tag to cluster in kubernetes"
  ],
  "cs_cluster_access": [
    "unable to view or work with the cluster",
    "not seeing the kubernetes cluster listed",
    "What are the source groups in kubernetes",
    "How to check your user access permissions to access kubernetes?",
    "How to setup infrastructure account credentials properly for kubernetes?",
    "can't view the kubernetes cluster"
  ],
  "faq_access": [
    "What roles to I need to access kubernetes cluster?",
    "What access policies do I give my kubernetes cluster users", 
    "permission needed to create a kubernetes cluster",
    "grant access to users to my kubernetes cluster",
    "give some one access to my cluster",
    "set up user access to kubernetes clusters",
    "resolve kubernetes user permission",
    "How can I access a kubernetes cluster",
    "How can assign cluster access",
    "assign cluster access",
    "can I change kubernetes IAM roles",
    "can I change kubernetes user roles",
    "can I change user roles in kubernetes",
    "cluster access",
    "user access to kubernetes cluster",
    "Granting users access to kubernetes cluster through IAM",
    "permissions needed to create kubernetes clusters"
  ],
  "suspended": [
    "can't add worker nodes due to an invalid VLAN ID",
    "Could not obtain kubernetes network VLAN",
    "Why my kubernetes worker got deleted",
    "Why my kubernetes account was suspended",
    "What happens to my kubernetes cluster if my account got suspended.",
    "my kubernetes worker was deleted",
    "unable to add worker nodes because of an invalid VLAN"
  ],
  "cs_vpn_fails": [
    "can't establish VPN connectivity with the strongSwan Helm chart",
    "not able to connect from kubernetes to my on-premises server",
    "How to connect between kubernetes and on-premise",
    "connect between kubernetes and on-prem server",
    "Unable to establish VPN connectivity after running the Helm tests",
    "How to run VPN debugging tool for kubernetes",
    "unable to establish VPN connectivity to Helm"
  ],
  "orphaned": [
    "Unable to modify or delete infrastructure in an orphaned kubernetes cluster",
    "can't add or remove worker node for kubernetes?",
    "Not able to connect to your kubernetes infrastructure account",
    "How to reset the kubernetes infrastructure credentials",
    "Engineer who created kubernetes cluster unavailable",
    "can't delete infrastructure in a kubernetes cluster"
  ],
  "ts_clis": [
    "kubernetes CLI commands failing",
    "why getting error when run ibmcloud kubernetes command",
    "CLI commands not working in kubernetes",
    "kubectl commands failing in kubernetes",
    "calicoctl commands from CLI fail on kubernetes",
    "error with kubernetes CLI command"
  ],
  "faq_integrations": [
    "use IBM Cloud and other services with my kubernetes cluster",
    "Does kubernetes support integrated service",
    "What is the supported IBM Cloud and third party integrations",
    "kubernetes support intergrated services",
    "What are other services integrated with kubernetes cluster",
    "Cloud services can itegrate with kubernetes",
    "What is logging and monitoring service can integrate with kubernetes",
    "does kubernetes integrate with other cloud services"
  ],
  "kubectl_fails": [
    "How to get the kubectl version",
    "What version of kubectl kubernetes support",
    "which version of kubectl",
    "different version of kubectl than cluster version",
    "kubectl version error",
    "versions does kubectl support",
    "install kubectl version"
  ],
  "coredns_lameduck": [
    "Kubernetes cluster service DNS resolution sometimes fails when CoreDNS pods are restarted",
    "Why my app sometimes fails to resolve DNS names in kubernetes",
    "How to customize kubernetes cluster DNS provider",
    "Is coredns autoscalling in kubernetes",
    "coreDNS auto scalling in kubernetes",
    "In which namespace does coredns run",
    "DNS resolution fails after restarting CoreDNS pods"
  ],
  "cs_firewall": [
    "can't access resources in kubernetes cluster",
    "kubernetes worker node can't communicate to the private network",
    "getting error from server dial tcp: connection time out in cluster",
    "getting kubectl proxy error",
    "getting TLS handshake timeout in kubernetes",
    "getting kubectl proxy error in kubernetes cluster"
  ],
  "secure_cluster": [
    "options do I have to secure my kubernetes cluster",
    "security for IBM Cloud kubernetes services",
    "the security threats for my kubernetes cluster",
    "What does IBM Cloud Kubernetes Service do to secure my Kubernetes API server",
    "security in Kuberentes services",
    "to secure Kubernetes",
    "do to secure my Kubernetes API server",
    "need to secure my Kubernetes API server from threats"
  ],
  "usage": [
    "Can I view my current kubernetes usage",
    "check my current usage and estimated monthly cost for kubernetes",
    "check my current usage and estimated monthly amount for kubes",
    "how to Export my usage details to a file",
    "How to check Billing and usage for my cluster",
    "view my current usage for kubernetes"
  ],
  "ts_firewall_clis": [
    "firewall prevents running kubernetes CLI commands",
    "Kubectl fail with error no resources found",
    "kubernetes error invalid object doesn't have additional properties",
    "kubernetes error: getsockopt",
    "kubernetes error: No Auth Provider found for name oidc",
    "install the version of kubectl that matches your cluster",
    "getting error No Auth Provider found for name oidc when run kubectl",
    "getting error invalid object doesn't have additional properties when run kubectl",
    "kubectl error No Auth Provider found for name oidc",
    "kubectl error invalid object doesn't have additional properties",
    "Kubectl fails with error no resources found"
  ],
"cs_strongswan_release": [
    "can't establish VPN connectivity with the strongSwan Helm chart",
    "Can't install a new strongSwan heml chart release",
    "How to delete previous release of strongSwan",
    "kubernetes VPN error: release vpn failed: deployments.extensions",
    "strongSwan VPN connectivity fails after you add or delete worker nodes",
    "strongSwan VPN connection fails when deleting worker node"
  ],
  "cs_duplicate_nodes": [
    "After kubernetes worker node updates or reloads, we see duplicate nodes",
    "Why am I seeing a duplicate nodes and pods",
    "Why kubernetes workers public IP address are notReady",
    "duplicate nodes disrupt my kubernetes services",
    "Why are we seeing duplicate pods in kubernetes",
    "duplicate pods in kubernetes",
    "duplicate nodes in kubernetes",
    "duplicate nodes and pods in kubernetes"
  ],
  "ts_image_pull_create": [
    "How to access my Registry repo for kubernetes",
    "Error can't pull images from Cloud Container Registry",
    "Your cluster can't pull images from Container Registry 'icr.io'",
    "What permission needed to pull image to my cluster",
    "Not able to pull an image from registry into my cluster"
  ]
}

